In [1]:
import pandas as pd

In [2]:
Pat = [5, 4, 4, 3, 9, 4]
Jack = [4, 8, 7, 5, 1, 5]
Alex = [9, 9, 8, 10, 4, 10]

In [5]:
all_scores = Pat + Jack + Alex
names = (['Pat'] * len(Pat)) +  (['Jack'] * len(Jack)) +  (['Alex'] * len(Alex))

In [6]:
data = pd.DataFrame({'names': names, 'score': all_scores})

In [8]:
data

   names  score
0    Pat      5
1    Pat      4
2    Pat      4
3    Pat      3
4    Pat      9
5    Pat      4
6   Jack      4
7   Jack      8
8   Jack      7
9   Jack      5
10  Jack      1
11  Jack      5
12  Alex      9
13  Alex      9
14  Alex      8
15  Alex     10
16  Alex      4
17  Alex     10

In [9]:
import statsmodels.api as sm
from statsmodels.formula.api import ols

In [12]:
lm = ols('score ~ names',data=data).fit()
table = sm.stats.anova_lm(lm)
print(table)

            df     sum_sq    mean_sq         F    PR(>F)
names      2.0  46.777778  23.388889  4.488273  0.029668
Residual  15.0  78.166667   5.211111       NaN       NaN

In [13]:
# compute overall mean
overall_mean = data['score'].mean()
overall_mean

6.055555555555555

In [29]:
# compute Sum of Squares Total
data['overall_mean'] = overall_mean
ss_total = sum((data['score'] - data['overall_mean'])**2)
ss_total

124.94444444444446

In [15]:
# compute group means
group_means = data.groupby('names').mean()
group_means = group_means.rename(columns = {'score': 'group_mean'})
group_means

       group_mean  overall_mean
names
Alex     8.333333      6.055556
Jack     5.000000      6.055556
Pat      4.833333      6.055556

In [20]:
# add group means and overall mean to the original data frame
data = data.merge(group_means, left_on = 'names', right_index = True)
data.head()

,names,score,overall_mean_x,group_mean_x,overall_mean_y,group_mean_y,overall_mean_x,group_mean,overall_mean_y
0,Pat,5,6.055556,4.833333,6.055556,4.833333,6.055556,4.833333,6.055556
1,Pat,4,6.055556,4.833333,6.055556,4.833333,6.055556,4.833333,6.055556
2,Pat,4,6.055556,4.833333,6.055556,4.833333,6.055556,4.833333,6.055556
3,Pat,3,6.055556,4.833333,6.055556,4.833333,6.055556,4.833333,6.055556
4,Pat,9,6.055556,4.833333,6.055556,4.833333,6.055556,4.833333,6.055556

In [21]:
data.columns

Index(['names', 'score', 'overall_mean_x', 'group_mean_x', 'overall_mean_y',
       'group_mean_y', 'overall_mean_x', 'group_mean', 'overall_mean_y'],
      dtype='object')

In [22]:
data['group_mean']

0     4.833333
1     4.833333
2     4.833333
3     4.833333
4     4.833333
5     4.833333
6     5.000000
7     5.000000
8     5.000000
9     5.000000
10    5.000000
11    5.000000
12    8.333333
13    8.333333
14    8.333333
15    8.333333
16    8.333333
17    8.333333
Name: group_mean, dtype: float64

In [23]:
# compute Sum of Squares Residual
ss_residual = sum((data['score'] - data['group_mean'])**2)
ss_residual

78.16666666666666

In [32]:
# compute Sum of Squares Model
ss_explained = sum((data['overall_mean'] - data['group_mean'])**2)
ss_explained

46.77777777777779

In [34]:
# compute Mean Square Residual
n_groups = len(set(data['names']))
n_obs = data.shape[0]
df_residual = n_obs - n_groups
ms_residual = ss_residual / df_residual
ms_residual

5.21111111111111

In [35]:
 #compute Mean Square Explained
df_explained = n_groups - 1
ms_explained = ss_explained / df_explained
ms_explained

23.388888888888896

In [36]:
# compute F-Value
f = ms_explained / ms_residual
f

4.488272921108744

In [37]:
# compute p-value
import scipy.stats
p_value = 1 - scipy.stats.f.cdf(f, df_explained, df_residual)
p_value

0.029667763955533277

### P-value is less than 0.05 so, the null hypothesis is rejected strongly

#### That the means of all population are not equal